---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnBaseAboveTopFailure
source: html/5cfd0261-bde9-6f05-4056-7873b0c1cfec.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnBaseAboveTopFailure Property

The column base can't be moved above its top.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnBaseAboveTopFailure { get; }
```